---
kind: type
id: T:Autodesk.Revit.DB.SunStudyTimeInterval
source: html/d09c8655-cbfa-6727-ca0c-9d1b4f12a767.htm
---
# Autodesk.Revit.DB.SunStudyTimeInterval

Time interval enum for a single or multi-day sun study.

## Syntax (C#)
```csharp
public enum SunStudyTimeInterval
```